from django.db import migrations, models


class Migration(migrations.Migration):

    dependencies = [
        ("accounts", "0012_alter_farmmembership_role"),
    ]

    operations = [
        migrations.AlterField(
            model_name="farmmembership",
            name="role",
            field=models.CharField(
                choices=[
                    ("مدير النظام", "مدير النظام"),
                    ("المدير المالي لقطاع المزارع", "المدير المالي لقطاع المزارع"),
                    ("مدقق مالي", "مدقق مالي"),
                    ("رئيس الحسابات", "رئيس الحسابات"),
                    ("مدير المزرعة", "مدير المزرعة"),
                    ("مهندس زراعي", "مهندس زراعي"),
                    ("مشرف ميداني", "مشرف ميداني"),
                    ("فني زراعي", "فني زراعي"),
                    ("مزارع", "مزارع"),
                    ("أمين مخزن", "أمين مخزن"),
                    ("أمين صندوق", "أمين صندوق"),
                    ("محاسب المزرعة", "محاسب المزرعة"),
                    ("مدير مبيعات", "مدير مبيعات"),
                    ("مسئول مشتريات", "مسئول مشتريات"),
                    ("مدخل بيانات", "مدخل بيانات"),
                    ("مشاهد", "مشاهد"),
                ],
                default="مشاهد",
                max_length=60,
            ),
        ),
        migrations.AlterField(
            model_name="roledelegation",
            name="role",
            field=models.CharField(
                choices=[
                    ("مدير النظام", "مدير النظام"),
                    ("المدير المالي لقطاع المزارع", "المدير المالي لقطاع المزارع"),
                    ("مدقق مالي", "مدقق مالي"),
                    ("رئيس الحسابات", "رئيس الحسابات"),
                    ("مدير المزرعة", "مدير المزرعة"),
                    ("مهندس زراعي", "مهندس زراعي"),
                    ("مشرف ميداني", "مشرف ميداني"),
                    ("فني زراعي", "فني زراعي"),
                    ("مزارع", "مزارع"),
                    ("أمين مخزن", "أمين مخزن"),
                    ("أمين صندوق", "أمين صندوق"),
                    ("محاسب المزرعة", "محاسب المزرعة"),
                    ("مدير مبيعات", "مدير مبيعات"),
                    ("مسئول مشتريات", "مسئول مشتريات"),
                    ("مدخل بيانات", "مدخل بيانات"),
                    ("مشاهد", "مشاهد"),
                ],
                max_length=60,
            ),
        ),
    ]
