from django.db import migrations, models


class Migration(migrations.Migration):

    dependencies = [
        ("accounts", "0013_alter_farmmembership_role_alter_roledelegation_role"),
    ]

    operations = [
        migrations.AlterField(
            model_name="farmmembership",
            name="role",
            field=models.CharField(
                max_length=60,
                choices=[
                    ("مدير النظام", "مدير النظام"),
                    ("محاسب القطاع", "محاسب القطاع"),
                    ("مراجع القطاع", "مراجع القطاع"),
                    ("رئيس حسابات القطاع", "رئيس حسابات القطاع"),
                    ("المدير المالي لقطاع المزارع", "المدير المالي لقطاع المزارع"),
                    ("مدير القطاع", "مدير القطاع"),
                    ("مدقق مالي", "مدقق مالي"),
                    ("رئيس الحسابات", "رئيس الحسابات"),
                    ("المدير المالي للمزرعة", "المدير المالي للمزرعة"),
                    ("مدير المزرعة", "مدير المزرعة"),
                    ("مهندس زراعي", "مهندس زراعي"),
                    ("مشرف ميداني", "مشرف ميداني"),
                    ("فني زراعي", "فني زراعي"),
                    ("مزارع", "مزارع"),
                    ("أمين مخزن", "أمين مخزن"),
                    ("أمين صندوق", "أمين صندوق"),
                    ("محاسب المزرعة", "محاسب المزرعة"),
                    ("مدير مبيعات", "مدير مبيعات"),
                    ("مسئول مشتريات", "مسئول مشتريات"),
                    ("مدخل بيانات", "مدخل بيانات"),
                    ("مشاهد", "مشاهد"),
                ],
                default="مشاهد",
            ),
        ),
        migrations.AlterField(
            model_name="roledelegation",
            name="role",
            field=models.CharField(
                max_length=60,
                choices=[
                    ("مدير النظام", "مدير النظام"),
                    ("محاسب القطاع", "محاسب القطاع"),
                    ("مراجع القطاع", "مراجع القطاع"),
                    ("رئيس حسابات القطاع", "رئيس حسابات القطاع"),
                    ("المدير المالي لقطاع المزارع", "المدير المالي لقطاع المزارع"),
                    ("مدير القطاع", "مدير القطاع"),
                    ("مدقق مالي", "مدقق مالي"),
                    ("رئيس الحسابات", "رئيس الحسابات"),
                    ("المدير المالي للمزرعة", "المدير المالي للمزرعة"),
                    ("مدير المزرعة", "مدير المزرعة"),
                    ("مهندس زراعي", "مهندس زراعي"),
                    ("مشرف ميداني", "مشرف ميداني"),
                    ("فني زراعي", "فني زراعي"),
                    ("مزارع", "مزارع"),
                    ("أمين مخزن", "أمين مخزن"),
                    ("أمين صندوق", "أمين صندوق"),
                    ("محاسب المزرعة", "محاسب المزرعة"),
                    ("مدير مبيعات", "مدير مبيعات"),
                    ("مسئول مشتريات", "مسئول مشتريات"),
                    ("مدخل بيانات", "مدخل بيانات"),
                    ("مشاهد", "مشاهد"),
                ],
            ),
        ),
    ]
